app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "recipe_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "Wow.. \r\n\r\nIts awesome.."], ["created_at", Thu, 28 Nov 2013 10:46:33 UTC +00:00], ["recipe_id", 1], ["updated_at", Thu, 28 Nov 2013 10:46:33 UTC +00:00], ["user_id", 1]]
INSERT INTO "activities" ("created_at", "key", "owner_id", "owner_type", "parameters", "recipient_id", "recipient_type", "trackable_id", "trackable_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @comment = @recipe.comments.build(params[:comment])
    @comment.user = current_user
    if @comment.save
      @comment.create_activity :create, owner: current_user

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = 1 AND "comments"."id" = ? LIMIT 1  [["id", "5"]]
---
  def edit
    @comment = current_user.comments.find(params[:id])

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = 1 AND "comments"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "comments" SET "content" = 'hello', "updated_at" = '2013-11-28 11:31:31.617752' WHERE "comments"."id" = 5
---
  def update
    @comment = current_user.comments.find(params[:id])
    if @comment.update_attributes(params[:comment])

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = 1 AND "comments"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
  def destroy
    @comment = current_user.comments.find(params[:id])
    @comment.destroy

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "2"]]
---
  def load_recipe
    @recipe = Recipe.find(params[:recipe_id])